Tekla Open API Reference for Tekla Structures 2025
Operation.CreateConicalBentPlateByPartsAndAperture Method
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts. The resulting bend will have the given aperture and the provided larger radius.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateConicalBentPlateByPartsAndAperture(
	Part part1,
	Part part2,
	double largestRadius,
	double halfAperture
)
Public Shared Function CreateConicalBentPlateByPartsAndAperture (
	part1 As Part,
	part2 As Part,
	largestRadius As Double,
	halfAperture As Double
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
One part used for creating the bent plate.
part2
Type: Tekla.Structures.Model.Part
The other part used for creating the bent plate.
largestRadius
Type: System.Double
Radius of the largest section of the cone
halfAperture
Type: System.Double
Angle between a generatrix of the cone and its center line (i.e. axis)
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace